// 1859 : 12:56 시작 - 13:10 끝
// 1974 : 13:11 시작 - 13:23 끝
// 11315 : 13:26 시작 - 13:50 끝
// 1954 : 13:51 시작 - 13:59 끝
// 4831 : 14:05 시작 - 14:33 끝
// 1206 : 14:36 시작 - 14:44 끝
// 1208 : 14:45 시작 - 장실 48 다시 시작 15:03 - 15:06 끝
// 1216 : 15:07 시작 -  15:58 -> 이상함. 다시

// 19113 : 16:45 시작 - 17:01 끝
// 18662 : 17:02 시작 - 17:34 끝
// 16910 : 17:35 시작 - 17:38 끝
// 1244 : 19:42 시작 - 

// 경비원 : 13:15 시작 - 13:54 끝 -> 다시
// 수열 : 13:56 시작 - 14:11 끝. -> 다시
// 개미 : 14:12 시작

#include <iostream>

using namespace std;

int main() {

	int R, C, sx, sy, N;
	cin >> R >> C >> sx >> sy >> N;

	int ansx = sx + N;
	ansx %= (2 * R);

	if (ansx > R) {
		ansx -= R;
		ansx = R - ansx;
	}
	int ansy = sy + N;
	ansy %= (2 * C);

	if (ansy > C) {
		ansy -= C;
		ansy = C - ansy;
	}

	cout << ansx << " " << ansy << "\n";
	return 0;
}